

# 작업용 기본 디렉터리 - setwd("디렉터리명")

# 아래와 같이 지정  \\
setwd("C:\\rscript")

# 현재 설정된 작업 디렉터리 확인
getwd()

# 또는 아래와 같이 지정 /
setwd("C:/rscript")
getwd()

# print() 함수 : R Console 화면에 내용을 출력하는 함수
print(1+2)

# 아래 코드는 print 명령이 생략된 것
1 + 2

# 문자를 출력할 때는 ' ' 를 사용
print('a')

# 아래와 같이 문자만 입력해도 정상적으로 출력
'a'

# 소수점일 경우 총 7자리로 출력
print(pi) # pi = 내장 상수값

# digits로 자리수 지정 가능
print(pi, digits = 3)

# 아래와 같이 두가지 데이터를 출력하면 첫 번째 데이터만 출력
print(3, 4)

# 문자의 경우는 에러 발생
print('a', 'b')

# 숫자와 문자 여러 개를 한꺼번에 출력
cat(1, ':', 'a', '\n', 2, ':', 'b')

# 각 명령을 세미콜론으로 구분
1; 2; 3

# 세미콜론을 기준으로 순서대로 실행
1+2; 2*3; 4/2

# 연산자의 우선순위에 따라 뒤의 * 부터 연산
1+2*3

# 만약 더하기부터 하려면 왼쪽처럼 괄호를 사용
(1+2) * 3

# 0이 4개 까지는 그대로 출력
10000

# 0이 5개부터는 1e+05로 출력
100000

# 0이 6개라서 결과에 1e+06으로 출력
1000000

# 1 * 10^2 이라는 뜻이므로 100이 출력
1e2

# 3 * 10^2 이라는 뜻이라서 3 * 100의 결과인 300이 출력
3e2

# -1은 소숫점 1자리로 출력하라는 뜻
3e-1

# -2는 소수점 2자리로 출력하라는 뜻
3e-2

# as.numeric() : 문자형 숫자를 연산 가능한 숫자로 변경하는 함수
'1' + '2'

# 숫자로 강제로 변환 후, 연산
as.numeric('1') + as.numeric('2')

# 문자라서 홑따옴표로 감싸고 출력
'First'

# 쌍다옴표로 감싸도 된다
"Second"

# 그냥 사용하면 변수 이름으로 인식이 되어서 에러가 발생
First

# class() : 데이터 형을 반환시켜주는 함수

# 문자형 데이터를 검사
class('1')

# 숫자형 데이터를 검사
class(1)


# 3 곱하기 0 의 뜻으로 거짓(False)
3 & 0

# 3 곱하기 1의 뜻으로 참 곱하기 참이라서 참(True)
3 & 1

# 참 곱하기 참이라서 결과도 참(True)
3 & 2

# 참 더하기 거짓 이라서 결과는 참(True)
3 | 0






# NA 형 & NULL 형

# NA : 결측값(값이 존재하더라도 사용할 수 없는 값)
# is.na(변수명) : 변수의 값이 NA인지를 확인하는 함수
# NULL : 값이 없는 상태

# NA가 그대로 출력
cat(1, NA, 2)

# NULL 값이 제거되고 출력
cat(1, NULL, 2)

# NA 를 더하니까 결과가 NA로 출력
sum(1, NA, 2)

# NULL 값은 제외해버리고,나머지 값만 더해서 결과가 출력
sum(1, NULL, 2)

# na.rm : NA 값을 수동으로 제거할 수 있는 파라미터

# NA 값이 연산 결과를 틀리게 만들었다
sum(1, 2, NA)

# na.rm=T 로 NA 값을 제거하고 계산
sum(1, 2, NA, na.rm = T)

# Factor 형 : 여러 번 중복으로 나오는 데이터들을 각각 모아서 대표 값으로 출력해주는 데이터 형

# Factor 형
setwd("c:\\rscript")
txt1 <- read.csv("factor_test.txt")
txt1

factor1 <- factor(txt1$blood)
factor1

summary(factor1)

gender_F <- factor(txt1$sex)
gender_F

summary(gender_F)

# 날짜와 시간

# 대소문자 주의! 날짜만 보여주는 함수
Sys.Date()

# 대소문자 주의! 날짜와 시간까지 보여주는 함수
Sys.time()

# 미국식 날짜와 시간을 보여주는 함수
date()

# 홑따옴표나 겹따옴표를 사용
as.Date('2014-11-01')
as.Date("2014/11/01")

# 의도하지 않은 날짜
as.Date("01-11-2014")

# 날짜 형태를 지정
as.Date("01-11-2014", format="%d-%m-%y")

as.Date("2014년 11월 1일", format="%Y년 %m월 %d일")

# 년도가 대문자 Y 사용
as.Date("01112014", format = "%d%m%Y")

# 년도가 소문자 y 사용
as.Date("011114", format = "%d%m%y")

# 기준 일자를 주고 몇 일 후 찾기
# 주어진 날짜기준으로 10일 후의 날짜




