# 벡터만들기
x <- c(80, 85, 70)
x

c(80, 85, 70) -> x
x

# 벡터 원소가 하나일 때
x <- c(80)
x

x <- 80
x

# 산술연산
x <- 5+2
x

x <- 5^2
x

x <- 5%%2
x

x <- 5%/%3
x

x <- seq(1, 10, by = 3)
x

y <- seq(1, 10, length.out = 5)
y

y <- seq(1, 10, length.out = 3)
y

y <- seq(1, 100, length.out = 20)
y

x <- c(1, 2, 3)
rep(x, times = 2) # x 벡터를 2번 반복
rep(x, each = 2)  # x 벡터의 각 원소를 2번 반복

# n 벡터를 구성하는 특정 원소 값들을 출력하거나, 수정하는 과정?
x <- c(1, 2, 3, 4, 5)

x[2]				# 두 번째 원소
x[c(1, 3, 5)]		# 1, 3, 5번째 원소
x[-c(2, 4)]			# 2, 4번째 제외한 원소
x[x > 2]			# 원소의 값이 2보다 큰 값들만 출력
x[x >= 2 & x <= 4]	# 원소의 값이 2이상이고 4이하인 값들만 출력
x[2] <- 20			# 2번째 원소의 값을 20으로 수정
x[c(3, 4)] <- 15		# 3, 4번째 원소들의 값을 모두 15로 수정
x[x <= 15] <- 10		# 15이하인 원소 값들을 모두 10으로 수정
x

# n 벡터 값에 대한 함수의 활용 예?
x <- seq(1:10)

mean(x)			# x 벡터의 원소 값들의 평균
var(x)			# x 벡터의 원소 값들의 분산
sd(x)				# x 벡터의 원소 값들의 표준편차
sqrt(x)			# x 벡터의 원소 값들의 제곱근
length(x)			# x 벡터의 원소 값들의 개수
abs(x)			# x 벡터의 원소 값들의 절대값


# n 배열: 한 개 이상의 벡터로 구성, 동일한 데이터 유형?
# n 1차원 배열: 벡터?
# n 2차원 배열: 행과 열, 행렬 ?
# n 함수: array()

x <- array(1:3, dim = c(3))
x

x <- array(1:6, dim=c(2,3))
x[1, 3]				# 1행 3열 값
x[, 3]				# 3열의 모든 값들
x[, -3]				# 3열을 제외한 모든 열의 값들
x[1, 2] <- 20			# 1행 2열의 값을 20으로 수정
names <- list(c("1행", "2행"), c("1열", "2열", "3열")) # 행과 열 이름을 갖는 두 벡터로 하는 리스트 생성
x
x <- array(1:6, dim=c(2,3), names)
x


# n 행렬: 행과 열로 구성되는 2차원 배열?
# n 함수: matrix()?

x <- matrix(1:6, ncol = 6) # 열의 갯수
x <- matrix(1:6, nrow = 6) # 행의 갯수
x


v1 <- c(1, 2, 3, 4)
v2 <- c(5, 6, 7, 8)
v3 <- c(9, 10, 11, 12)

x <- cbind(v1, v2 , v3) # 열 단위로 합침
x <- rbind(v1, v2 ,v3)  # 행 단위로 합침
x

rownames(x) <- c("1행", "2행", "3행", "4행") # x 행렬에 행의 이름 추가
colnames(x) <- c("1열", "2열", "3열")		 # x 행렬에 열의 이름 추가



# n 벡터의 각 원소: 이름, 서로 다른 데이터 유형 가능, 하나 이상의 값 가능?
# n 함수: list()?

x <- list("홍길동", "20200330", 20, c("IT융합", "데이터 관리"))
x

y <- list("성명" = "홍길동", "학번" = "20200330", "나이" = 20, "수강과목" = c("IT융합", "데이터 관리"))
y


# n 동일한 속성들을 가지는 여러 개체들로 구성?
# n 2차원적인 데이터 구조 ?
# n 속성들 간 데이터 유형은 서로 다를 수 있음?

x <- data.frame(성명=c("홍길동", "손오공"), 나이 = c(20, 30), 주소 = c("서울", "부산"))
x

rownames(x) = c("1열", "2열") # 행 이름 변경

x <- cbind(x, 학과 = c("전산학", "경영학"))		# 데이터 프레임 x에 열(학과) 추가
x <- rbind(x, data.frame(성명 = "장발장", 나이 = 40, 주소 = "파리", 학과 = "전산학")) # 데이터 프레임 x에 행(장발장) 추가

x[3, 2]				# 3행 2열의 요소 값
x[3, ]				# 3행의 모든 값
x[-2, ]				# 2행을 제외한 모든 값
x["성명"]				# "성명"요소 , x[1]과 동일한 결과
x$성명, x[["성명"]], x[[1]]	# "성명"요소값
x[[1]][2]				# 1열 요소 값에서 두 번째 값




# 데이터 세트 읽는 방법
# 외부 데이터 읽는 방법 

# 데이터 세트 읽는 방법

quakes				# R에 내장된 quakes 데이터 세트 출력

head(quakes, n = 10)		# 데이터 앞부분 10개 행 보기(디폴트 n은 6)
tail(quakes, n = 6)		# 데이터 뒷부분 일부 보기(디폴트 n은 6)
names(quakes)			# 'quakes' 데이터 세트의 변수명 보기
str(quakes)				# 'quakes' 데이터 세트의 데이터 구조 보기
dim(quakes)				# 'quakes' 데이터 세트의 차원 보기(행과 열의 수)
summary(quakes)			# 'quakes' 데이터 세트의 각 변수별 데이터 요약 정보
summary(quakes$mag)		# 'quakes' 데이터 세트 내의 mag 변수에 대한 최솟값,
					# 25백분위수, 중앙값, 평균값, 75백분위수, 최댓값
summary(quakes$depth)


# 데이터파일 저장 및 읽기

write.table(quakes, "c:/rscript/quakes.txt", sep=",")

x <- read.csv("c:/rscript/quakes.txt", header = T)
x

x <- read.csv(file.choose(), header = T)






